CSI API ETABS v1

# cAreaObjGetEdgeConstraint Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetEdgeConstraint(
    	string Name,
    	ref bool ConstraintExists
    )

    Function GetEdgeConstraint (
    	Name As String,
    	ByRef ConstraintExists As Boolean
    ) As Integer

    Dim instance As cAreaObj
    Dim Name As String
    Dim ConstraintExists As Boolean
    Dim returnValue As Integer

    returnValue = instance.GetEdgeConstraint(Name,
    	ConstraintExists)

    int GetEdgeConstraint(
    	String^ Name,
    	bool% ConstraintExists
    )

    abstract GetEdgeConstraint :
            Name : string *
            ConstraintExists : bool byref -> int

#### Parameters

Name

    Type: SystemString

ConstraintExists

    Type: SystemBoolean

#### Return Value

Type: Int32

See Also

#### Reference

cAreaObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com